serial/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

mergeTolerance 1e-6;

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    sphere.stl
    {
        type triSurfaceMesh;
        name sphere;
    }
}

castellatedMeshControls
{
    maxLocalCells  10000000;
    maxGlobalCells 20000000;
    minRefinementCells 0;
    nCellsBetweenLevels 2;

    features ();

    refinementRegions
    {
    }

    refinementSurfaces
    {
        sphere
        {
            level (2 2);
            faceType wall;
            cellZone sphereZone;
            cellZoneInside inside;
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;
    refinementRegions {}
    locationInMesh (10.0 0.0 0.0);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
}

addLayersControls
{
    relativeSizes       true;
    layers              
    {
        wafer
        {
            nSurfaceLayers 8;
        }
    };
    expansionRatio      1.2;
    finalLayerThickness 0.3;
    minThickness        0.01;
    nGrow               0;
    featureAngle        60;
    nRelaxIter          3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals      3;
    nSmoothThickness    10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle  90;
    nBufferCellsNoExtrude 0;
    nLayerIter          50;
}

meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave 80;
    minFlatness 0.5;
    minVol 1e-13;
    minTetQuality 1e-9;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.001;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.75;
}

