serial/system/forceCoeffs
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      forceCoeffs;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

forces
{
    type            forceCoeffs;
    libs            ("libforces.so");

    executeControl  writeTime;   // ★ solver のwriteと同じタイミングで実行
    writeControl    writeTime;

    patches         ("sphere");

    rho             rhoInf;  // Indicates incompressible
    rhoInf          1;       // Required when rho = rhoInf

    magUInf         0.01;    // Freestream velocity magnitude [m/s]
    lRef            1.0;    // Reference length [m]
    Aref            0.785398;  // Reference area [m2]

    dragDir         (1 0 0);
    liftDir         (0 1 0);
    pitchAxis       (0 0 1);
    CofR            (0 0 0); // Axle midpoint on ground
    log             true;
}


// ************************************************************************* //
